/****************************************************************************
Задача 1_4.

Дано натуральное число N. Представить N в виде A + B, так, что
НОД(A, B) максимален, A ≤ B. Вывести A и B. Если возможно несколько
ответов - вывести ответ с минимальным A.
n ≤ 10^7.

  in  | out
  ----|------
  35  | 7 28
****************************************************************************/

#include <iostream>

using namespace std;

int main()
{
    int n, m=0, k=0, res1=0, res2=0;
    cin >> n;
    int d = n/2+1;
    for(int i=2;i<=d;i++)
    {
        if(n%i==0)
        {
            res1 = n/i;
            res2 = n/i*(i-1);
            break;
        }
    };
    if (res1==0)
    {
        res1 = 1;
        res2 = n-1;
    };
    cout << res1 << ' ' << res2;
    return 0;
}
