/****************************************************************************
Задача 1_2.

Вывести разложение натурального числа n на простые множители.
Простые множители должны быть упорядочены по возрастанию и разделены
пробелами.
2 ≤ n ≤ 10^6.

  in  | out
  ----|-------
  75  | 3 5 5
****************************************************************************/

#include <iostream>

using namespace std;

int main()
{
    int n;
    cin >> n;
    for(int i=2;i*i<=n;i++)
    {
        while(n%i==0)
        {
            n/=i;
            cout << i << " ";
        }
    };
    if(n!=1) cout << n;
    return 0;
}

