/****************************************************************************
Задача 3_2.

Дан массив целых чисел А[0..n-1]. Известно, что на интервале
[0, m] значения массива строго возрастают, а на интервале [m, n-1]
строго убывают. Найти m за O(log m).
2 ≤ n ≤ 10000.

  in                   | out
  ---------------------|-----
  10                   | 6
  1 2 3 4 5 6 7 6 5 4  | 

****************************************************************************/

#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    int n, a[10000], d;
    cin >> n;
    for(int i=0;i<n;i++)
        cin >> a[i];
    int k = log2(n);
    for(int i=2;i<=k;i++)
    {
        d =pow(2, i);
        if(d==n) d--;
        if(a[d-1]<a[d]) continue;
        else
        {
            while(a[d-1]>a[d])
                d--;
            cout << d;
            return 0;
        }
    }
    for(int i=d;i<n-1;i++)
    {
        if(a[i]>a[i+1])
        {
            cout << i;
            return 0;
        }
    }
    cout << n-1;
    return 0;
}
